[{
  "_id": {
    "$oid": "64dc43a6fb298cc4bb39ec83"
  },
  "ModuleNo": 1,
  "ModuleTitle": "Introduction to BigData, Architectureand Patterns",
  "Topics": "Review of Big Data landscape, Big Data: Why and Where,Characteristics of Big Data (V’s of Big Data) andDimensions of Scalability, Data Ingestion, Data Collection,Data processing, Data Storage Layer, Data Querying andData Visualization Layer, Concepts of Data Ingestion, DataStorage, Data Quality, Data Operations.",
  "NoOfLectures": 8
},
{
  "_id": {
    "$oid": "64dc43e9fb298cc4bb39ec86"
  },
  "ModuleNo": 2,
  "ModuleTitle": "Big Data Sourcesand Formats",
  "Topics": "Structured vs. Semi-structured vs. Unstructured, Batch vs.Streams, Understanding Data Lakes, Exploring the Relational Data Model of CSV Files, Exploring the Semi-structured Data Model of JSON data, Exploring the RC andORC File Formats, Exploring Streaming Sensor Data,Exploring Streaming Twitter Data.",
  "NoOfLectures": 6
},
{
  "_id": {
    "$oid": "64dc4414fb298cc4bb39ec89"
  },
  "ModuleNo": 3,
  "ModuleTitle": "Big Data Sourcesand Formats",
  "Topics": "Need, Parameters, Challenges, Key Functions, Big DataIngestion Tools: Common Features, Objectives, Benefits,Examples.",
  "NoOfLectures": 3
},
{
  "_id": {
    "$oid": "64dc444afb298cc4bb39ec8c"
  },
  "ModuleNo": 4,
  "ModuleTitle": "Big Data StorageTechnologies",
  "Topics": "Big Data Technologies: Hadoop, NoSQL and NewSQL,Using Hadoop to Store Data (HDFS, HBASE), FromDBMS to BDMS, Redis: An Enhanced Key-Value Store,Semi-structured Data – AsterixDB, Solr: Managing Text,Relational Data – Vertica.",
  "NoOfLectures": 8
},
{
  "_id": {
    "$oid": "64dc446cfb298cc4bb39ec8f"
  },
  "ModuleNo": 5,
  "ModuleTitle": "Using Sqoop forBig Data Ingestion",
  "Topics": "Sqoop Import, Import Data from MySql to HDFS, OtherVariations of Sqoop Import Command, Sqoop ExportCommand, Sqoop Jobs.",
  "NoOfLectures": 8
},
{
  "_id": {
    "$oid": "64dc4492fb298cc4bb39ec92"
  },
  "ModuleNo": 6,
  "ModuleTitle": "Using Flume forBig Data Ingestion",
  "Topics": "What is Flume, and where it is used, Difference betweenFlume and Sqoop, How Flume Works, What is FlumeAgent, What are the Components of Flume Agent, How7 Data Flows between Various Components of the Flume.",
  "NoOfLectures": 7
}]